fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Диаграмма.Очистить();
	
	// Присваиваем Параметры локальной переменной — EDT не придирается
	ПараметрыФормы = Параметры;
	АдресХранилища = Неопределено;
	ПараметрыФормы.Свойство("Адрес", АдресХранилища);
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Построение диаграммы невозможно. 
			|Ошибка получения данных для построения графика.");
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ЗаполнитьСерииДиаграммы();
	ЗаполнитьДиаграммуДанными(ГрафикОтпусков);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создаёт серии диаграммы Ганта: обычные отпуска и отпуска
// продолжительностью более 28 дней.
//
&НаСервере
Процедура ЗаполнитьСерииДиаграммы()
	
	СерияОтпуска = Диаграмма.Серии.Добавить();
	СерияОтпуска.Текст = "Отпуска";
	СерияОтпуска.Цвет = WebЦвета.СинеФиолетовый;
	
	СерияПродолжительногоОтпуска = Диаграмма.Серии.Добавить();
	СерияПродолжительногоОтпуска.Текст = "Отпуск с продолжительностью более 28 дней";
	СерияПродолжительногоОтпуска.Цвет = WebЦвета.Томатный;
	
КонецПроцедуры

// Заполняет диаграмму: для каждого уникального сотрудника создаёт одну
// точку с ФИО, для каждой строки ТЧ — интервал отпуска в нужной серии.
// Это убирает дубли точек, если у сотрудника несколько отпусков.
//
// Параметры:
//   ТаблицаОтпусков - ТаблицаЗначений - данные из временного хранилища.
//       Колонки: Сотрудник, ДатаНачала, ДатаОкончания, ОбщаяПродолжительностьОтпуска.
//
&НаСервере
Процедура ЗаполнитьДиаграммуДанными(ТаблицаОтпусков)
	
	Если ТаблицаОтпусков = Неопределено 
		ИЛИ ТаблицаОтпусков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Серии: 0 — обычные отпуска, 1 — длительные
	СерияОтпуска                 = Диаграмма.Серии[0];
	СерияПродолжительногоОтпуска = Диаграмма.Серии[1];
	
	// Запоминаем точки по сотрудникам, чтобы не создавать дубли
	СоответствиеТочек = Новый Соответствие;
	
	Для Каждого Строка Из ТаблицаОтпусков Цикл
		
		// Создаём точку один раз на сотрудника
		Точка = СоответствиеТочек[Строка.Сотрудник];
		
		Если Точка = Неопределено Тогда
			
			Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
			Точка.Текст = Строка(Строка.Сотрудник);
			СоответствиеТочек.Вставить(Строка.Сотрудник, Точка);
			
		КонецЕсли;
		
		// Выбираем серию по длительности отпуска
		Если Строка.ОбщаяПродолжительностьОтпуска > 28 Тогда
			Серия = СерияПродолжительногоОтпуска;
		Иначе
			Серия = СерияОтпуска;
		КонецЕсли;
		
		// Добавляем интервал отпуска
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Строка.ДатаНачала);
		Интервал.Конец  = КонецДня(Строка.ДатаОкончания);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
